import React from 'react';
import "./Textarea.css";

const TextArea = () => (
  <div className="text-area">
    <div className="passage">
      <p>
        ଓଡ଼ିଆ ଲିଖା ପାଇଁ ଏକ ଡେମୋ ପାରିକ୍ଷା କରାଯାଇଛି ଏହି ସମୟରେ ତୁମେ ଆଗରୁ ଦିଆଯାଇଥିବା ପାସାଜକୁ ସଠିକ ଭାବରେ ଲିଖିବାକୁ ପଡ଼ିବ | ଯେଉଁଠି ସମସ୍ତେ ଏହି ପରୀକ୍ଷାରେ ଯୋଗ ଦେଇଛନ୍ତି ସେମାନେ ନିଜେ ଯତ୍ନ କରି କମ୍ପୁଟରରେ ଲେଖିବେ ଏବଂ ନିଜର ତିଆରି ଦେଖାଉଛନ୍ତି | ଏହି ଲିଖା କରିବା ସମୟରେ କୌଣସି ଜନ୍ତୁ କିମ୍ବା ଆଶା କରିବାକୁ ନାହିଁ ତୁମେ ନିଜେ କରିବାକୁ ପଡ଼ିବ | ମୋ ଆଶା ରହିଛି ସେମାନେ ଭଲ ଭାବେ ତିଆରି ହେବେ | ଓଡ଼ିଆ ଲିଖା ପାଇଁ ଏକ ଡେମୋ ପାରିକ୍ଷା କରାଯାଇଛି ଏହି ସମୟରେ ତୁମେ ଆଗରୁ ଦିଆଯାଇଥିବା ପାସାଜକୁ ସଠିକ ଭାବରେ ଲିଖିବାକୁ ପଡ଼ିବ | ଯେଉଁଠି ସମସ୍ତେ ଏହି ପରୀକ୍ଷାରେ ଯୋଗ ଦେଇଛନ୍ତି ସେମାନେ ନିଜେ ଯତ୍ନ କରି କମ୍ପୁଟରରେ ଲେଖିବେ ଏବଂ ନିଜର ତିଆରି ଦେଖାଉଛନ୍ତି | ଏହି ଲିଖା କରିବା ସମୟରେ କୌଣସି ଜନ୍ତୁ କିମ୍ବା ଆଶା କରିବାକୁ ନାହିଁ ତୁମେ ନିଜେ କରିବାକୁ ପଡ଼ିବ | ମୋ ଆଶା ରହିଛି ସେମାନେ ଭଲ ଭାବେ ତିଆରି ହେବେ |
      </p>
    </div>
    <textarea className="typing-box"></textarea>
    <div className="instruction-1">
      Use ALT+SHIFT Key to Change Keyboard Layout to Odia (Inscript)
    </div>
  </div>
);

export default TextArea;
