import React from 'react';
import './TypingArea.css';

const TypingArea = () => {
  return (
    <div className="typing-area">
      <div className="text-display">
        पेड़ हम सभीके लिए बहुत जरूरी हैं। पेड़ों के कारण ही हमारी यह धरती हरी-भरी है। पेड़ों के कारही हमारी इस पृथ्वी पर पशु-पक्षी और कीड़े-मकोड़े जीवित रहते हैं। हम सभी जिस ऑक्सीजन के कारण जीवित हैं वह ऑक्सीजन हमें पेड़ों से ही मिलती है। मनुष्य बहुत समय पहले से ही पेड़ों से मिलने वाली लकड़ियों से आग जलाता था और उससे अपना भोजन बनाता था। पेड़ों की लकड़ियों से ही लोग अपने घर और फर्नीचर बनाते हैं। पेड़ों से हमें फल मिलते हैं, सुंदर-सुंदर फूल मिलते हैं, पेड़ों से हमें मसाले मिलते हैं। कुछ पेड़ों के फल, पत्तियों और जड़ों से बहुत सी दवाइयाँ बनती हैं। इस तरह पेड़ हमारे मित्र हैं जो हमारे काम में आते हैं। पेड़ प्रकृति की सहायता करते हैं क्योंकि जहाँ पेड़ होते  हैं वहाँ बादल आते हैं बारिश होती है, पक्षी और जानवरों को भी रहने की जगह मिलती है। बहुत दुख की बात है कि हम लोगों ने इतने ज्यादा पेड़ों को काट दिया है कि हमारी धरतीपर ऑक्सीजन की कमी हो गई है। हम सभी को अधिक से अधिक पेड़ लगाने चाहिए ताकि हमारा और पशु-पक्षियों का जीवन सुरक्षित रहे। 
      </div>
      <textarea className="text-input" />
      <button>End Typing Test</button>
    </div>
  );
};

export default TypingArea;
